grevaillot/svd_tools/headers/STM32H7x7_CM7/sai4.h
/** @defgroup sai4_sai_afrcr SAIAFRCR This register has no meaning in AC97 and SPDIF audio protocol
@{*/

/** SAI4_SAI_AFRCR_FSOFF Frame synchronization offset. This bit is set and cleared by software. It is meaningless and is not used in AC97 or SPDIF audio block configuration. This bit must be configured when the audio block is disabled. **/
#define SAI4_SAI_AFRCR_FSOFF		(1 << 18)
/** SAI4_SAI_AFRCR_FSPOL Frame synchronization polarity. This bit is set and cleared by software. It is used to configure the level of the start of frame on the FS signal. It is meaningless and is not used in AC97 or SPDIF audio block configuration. This bit must be configured when the audio block is disabled. **/
#define SAI4_SAI_AFRCR_FSPOL		(1 << 17)
/** SAI4_SAI_AFRCR_FSDEF Frame synchronization definition. This bit is set and cleared by software. When the bit is set, the number of slots defined in the SAI_xSLOTR register has to be even. It means that half of this number of slots will be dedicated to the left channel and the other slots for the right channel (e.g: this bit has to be set for I2S or MSB/LSB-justified protocols...). This bit is meaningless and is not used in AC97 or SPDIF audio block configuration. It must be configured when the audio block is disabled. **/
#define SAI4_SAI_AFRCR_FSDEF		(1 << 16)

#define SAI4_SAI_AFRCR_FSALL_SHIFT		8
#define SAI4_SAI_AFRCR_FSALL_MASK		0x7f
/** @defgroup sai4_sai_afrcr_fsall FSALL Frame synchronization active level length. These bits are set and cleared by software. They specify the length in number of bit clock (SCK) + 1 (FSALL[6:0] + 1) of the active level of the FS signal in the audio frame These bits are meaningless and are not used in AC97 or SPDIF audio block configuration. They must be configured when the audio block is disabled.
@{*/
/**@}*/


#define SAI4_SAI_AFRCR_FRL_SHIFT		0
#define SAI4_SAI_AFRCR_FRL_MASK		0xff
/** @defgroup sai4_sai_afrcr_frl FRL Frame length. These bits are set and cleared by software. They define the audio frame length expressed in number of SCK clock cycles: the number of bits in the frame is equal to FRL[7:0] + 1. The minimum number of bits to transfer in an audio frame must be equal to 8, otherwise the audio block will behaves in an unexpected way. This is the case when the data size is 8 bits and only one slot 0 is defined in NBSLOT[4:0] of SAI_xSLOTR register (NBSLOT[3:0] = 0000). In master mode, if the master clock (available on MCLK_x pin) is used, the frame length should be aligned with a number equal to a power of 2, ranging from 8 to 256. When the master clock is not used (NODIV = 1), it is recommended to program the frame length to an value ranging from 8 to 256. These bits are meaningless and are not used in AC97 or SPDIF audio block configuration.
@{*/
/**@}*/


/**@}*/

/** @defgroup sai4_sai_aslotr SAIASLOTR This register has no meaning in AC97 and SPDIF audio protocol
@{*/


#define SAI4_SAI_ASLOTR_SLOTEN_SHIFT		16
#define SAI4_SAI_ASLOTR_SLOTEN_MASK		0xffff
/** @defgroup sai4_sai_aslotr_sloten SLOTEN Slot enable. These bits are set and cleared by software. Each SLOTEN bit corresponds to a slot position from 0 to 15 (maximum 16 slots). The slot must be enabled when the audio block is disabled. They are ignored in AC97 or SPDIF mode.
@{*/
/**@}*/


#define SAI4_SAI_ASLOTR_NBSLOT_SHIFT		8
#define SAI4_SAI_ASLOTR_NBSLOT_MASK		0x0f
/** @defgroup sai4_sai_aslotr_nbslot NBSLOT Number of slots in an audio frame. These bits are set and cleared by software. The value set in this bitfield represents the number of slots + 1 in the audio frame (including the number of inactive slots). The maximum number of slots is 16. The number of slots should be even if FSDEF bit in the SAI_xFRCR register is set. The number of slots must be configured when the audio block is disabled. They are ignored in AC97 or SPDIF mode.
@{*/
/**@}*/


#define SAI4_SAI_ASLOTR_SLOTSZ_SHIFT		6
#define SAI4_SAI_ASLOTR_SLOTSZ_MASK		0x03
/** @defgroup sai4_sai_aslotr_slotsz SLOTSZ Slot size This bits is set and cleared by software. The slot size must be higher or equal to the data size. If this condition is not respected, the behavior of the SAI will be undetermined. Refer to Section: Output data line management on an inactive slot for information on how to drive SD line. These bits must be set when the audio block is disabled. They are ignored in AC97 or SPDIF mode.
@{*/
/**@}*/


#define SAI4_SAI_ASLOTR_FBOFF_SHIFT		0
#define SAI4_SAI_ASLOTR_FBOFF_MASK		0x1f
/** @defgroup sai4_sai_aslotr_fboff FBOFF First bit offset These bits are set and cleared by software. The value set in this bitfield defines the position of the first data transfer bit in the slot. It represents an offset value. In transmission mode, the bits outside the data field are forced to 0. In reception mode, the extra received bits are discarded. These bits must be set when the audio block is disabled. They are ignored in AC97 or SPDIF mode.
@{*/
/**@}*/


/**@}*/

/** @defgroup sai4_sai_aim SAIAIM Interrupt mask register 2
@{*/

/** SAI4_SAI_AIM_LFSDETIE Late frame synchronization detection interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt will be generated if the LFSDET bit is set in the SAI_xSR register. This bit is meaningless in AC97, SPDIF mode or when the audio block operates as a master. **/
#define SAI4_SAI_AIM_LFSDETIE		(1 << 6)
/** SAI4_SAI_AIM_AFSDETIE Anticipated frame synchronization detection interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt will be generated if the AFSDET bit in the SAI_xSR register is set. This bit is meaningless in AC97, SPDIF mode or when the audio block operates as a master. **/
#define SAI4_SAI_AIM_AFSDETIE		(1 << 5)
/** SAI4_SAI_AIM_CNRDYIE Codec not ready interrupt enable (AC97). This bit is set and cleared by software. When the interrupt is enabled, the audio block detects in the slot 0 (tag0) of the AC97 frame if the Codec connected to this line is ready or not. If it is not ready, the CNRDY flag in the SAI_xSR register is set and an interruption i generated. This bit has a meaning only if the AC97 mode is selected through PRTCFG[1:0] bits and the audio block is operates as a receiver. **/
#define SAI4_SAI_AIM_CNRDYIE		(1 << 4)
/** SAI4_SAI_AIM_FREQIE FIFO request interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt is generated if the FREQ bit in the SAI_xSR register is set. Since the audio block defaults to operate as a transmitter after reset, the MODE bit must be configured before setting FREQIE to avoid a parasitic interruption in receiver mode, **/
#define SAI4_SAI_AIM_FREQIE		(1 << 3)
/** SAI4_SAI_AIM_WCKCFGIE Wrong clock configuration interrupt enable. This bit is set and cleared by software. This bit is taken into account only if the audio block is configured as a master (MODE[1] = 0) and NODIV = 0. It generates an interrupt if the WCKCFG flag in the SAI_xSR register is set. Note: This bit is used only in TDM mode and is meaningless in other modes. **/
#define SAI4_SAI_AIM_WCKCFGIE		(1 << 2)
/** SAI4_SAI_AIM_MUTEDETIE Mute detection interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt is generated if the MUTEDET bit in the SAI_xSR register is set. This bit has a meaning only if the audio block is configured in receiver mode. **/
#define SAI4_SAI_AIM_MUTEDETIE		(1 << 1)
/** SAI4_SAI_AIM_OVRUDRIE Overrun/underrun interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt is generated if the OVRUDR bit in the SAI_xSR register is set. **/
#define SAI4_SAI_AIM_OVRUDRIE		(1 << 0)

/**@}*/

/** @defgroup sai4_sai_asr SAIASR Status register
@{*/


#define SAI4_SAI_ASR_FLVL_SHIFT		16
#define SAI4_SAI_ASR_FLVL_MASK		0x07
/** @defgroup sai4_sai_asr_flvl FLVL FIFO level threshold. This bit is read only. The FIFO level threshold flag is managed only by hardware and its setting depends on SAI block configuration (transmitter or receiver mode). If the SAI block is configured as transmitter: If SAI block is configured as receiver:
@{*/
/**@}*/

